Revit 2026 API

# ImporterIFC Methods

---

The ImporterIFC type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOptions | Gets the collection of named options set by the importer client. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
|  | ProcessIFCProject(IFCAnyHandle, IDictionaryIFCAnyHandle, ElementId) |  |
|  | SetFile | Sets the handle to the IFC file being created during this import operation. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ImporterIFC Class

Autodesk.Revit.DB.IFC Namespace